app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "..."], ["body", "..."], ["created_at", "2023-12-18 23:48:54.351571"], ["updated_at", "2023-12-18 23:48:54.351571"]]
---
  def create
    @article = Article.new(title: "...", body: "...")

    if @article.save